Tekla Open API Reference for Tekla Structures 2025
Localization.DefaultLocalizationFile Property
 The path and name of the default localization file.
 Namespace: Tekla.Structures.Dialog
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static string DefaultLocalizationFile { get; }
Public Shared ReadOnly Property DefaultLocalizationFile As String
	Get
Property Value
Type: String
See Also
Reference
Localization Class
Tekla.Structures.Dialog Namespace